load_tests/mixed-ramp-test.yml
# =============================================================================
# MealHub — Mixed Ramp Test (Realistic Traffic)
# File   : mixed-ramp-test.yml
# Purpose: Realistic production traffic mix with proper seeded auth.
#          Replaces the old 03-ramp-test.yml that had 40% fake-login noise.
#
# PRE-REQUISITE: Run seed-load-test-users.sql before this test.
#
# Traffic mix (matches real app analytics):
#   70% — public browse (restaurant list, menu, search, categories)
#   20% — authenticated reads (login + profile/orders/notifications)
#   10% — order placement simulation (login + browse + POST order)
#
# SUCCESS TARGETS:
#   • 2xx success rate   ≥ 75%
#   • p95 latency        < 1000ms
#   • 5xx errors         = 0 (absolute zero — backend must never crash)
#   • Timeouts           = 0
#   • true backend failure rate (5xx + timeout) < 0.1%
#
# NOTE on 25% headroom:
#   Supabase /auth/v1/token has per-project rate limits (~30 req/s on free,
#   higher on Pro).  Auth-heavy scenarios will hit 429 during peak phases.
#   429 is NOT a backend failure — it's expected rate-limiting behaviour.
#   analyze-results.js breaks this out separately.
#
# RUN:
#   artillery run load_tests/mixed-ramp-test.yml \
#             --output load_tests/reports/mixed-ramp.json
#   node load_tests/analyze-results.js load_tests/reports/mixed-ramp.json
# =============================================================================

config:
  target: "https://yharweliruemjexmuuxn.supabase.co"
  processor: "./processor.js"
  http:
    timeout: 20
    cookie: false

  variables:
    anonKey: "sb_publishable_e-McqdkcLyoxV89A86lWGw_hD3vyVP6"

  phases:
    # Phase 1 — warm-up
    - name: "Warm-up"
      duration: 60
      arrivalRate: 5
      maxVusers: 40

    # Phase 2 — ramp to moderate load
    - name: "Ramp 5→30 req/s"
      duration: 120
      arrivalRate: 5
      rampTo: 30
      maxVusers: 120

    # Phase 3 — hold at 30: primary measurement window
    - name: "Hold 30 req/s"
      duration: 180
      arrivalRate: 30
      maxVusers: 150

    # Phase 4 — push to peak
    - name: "Ramp 30→60 req/s"
      duration: 120
      arrivalRate: 30
      rampTo: 60
      maxVusers: 250

    # Phase 5 — hold at peak for 3 minutes
    - name: "Hold 60 req/s"
      duration: 180
      arrivalRate: 60
      maxVusers: 300

    # Phase 6 — cool down
    - name: "Cool-down"
      duration: 60
      arrivalRate: 60
      rampTo: 5
      maxVusers: 60

  ensure:
    thresholds:
      - http.response_time.p95: 1000
      - http.response_time.p99: 4000
      - http.codes.200: 75    # ≥75% 2xx  (remaining budget = 429 auth rate limits)

scenarios:

  # ── Public Browse (70%) ─────────────────────────────────────────────────────
  - name: "Public Browse"
    weight: 70
    flow:
      - function: "generateUserContext"

      # Home screen
      - get:
          url: "/rest/v1/restaurants?select=id,name,rating,cuisine_type,is_open,delivery_fee,estimated_delivery_time,image_url&is_open=eq.true&is_verified=eq.true&store_type=neq.grocery&order=rating.desc&limit=20"
          headers:
            apikey: "{{ anonKey }}"
          afterResponse: "cacheRestaurantIds"
          capture:
            - json: "$[0].id"
              as: "restaurantId"
          expect:
            - statusCode: 200

      - think: 2

      # Menu page
      - get:
          url: "/rest/v1/menus?select=id,name,price,category,is_available&restaurant_id=eq.{{ restaurantId }}&is_available=eq.true&order=category.asc&limit=50"
          headers:
            apikey: "{{ anonKey }}"
          afterResponse: "cacheMenusAndLog"
          expect:
            - statusCode: 200

      - think: 2

      # Inline search
      - get:
          url: "/rest/v1/restaurants?select=id,name,rating,cuisine_type&or=(name.ilike.*{{ searchQuery }}*,cuisine_type.ilike.*{{ searchQuery }}*)&is_open=eq.true&limit=10"
          headers:
            apikey: "{{ anonKey }}"
          expect:
            - statusCode: 200

  # ── Authenticated Reads (20%) ───────────────────────────────────────────────
  - name: "Auth Reads"
    weight: 20
    flow:
      - function: "generateUserContext"

      # Login with seeded user
      - post:
          url: "/auth/v1/token?grant_type=password"
          headers:
            apikey: "{{ anonKey }}"
            Content-Type: "application/json"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          afterResponse: "extractAuthToken"
          expect:
            - statusCode:
                - 200
                - 429   # rate-limit — expected at high concurrency, not a backend crash

      - think: 1

      # Profile
      - get:
          url: "/rest/v1/users?select=id,name,email,address&id=eq.{{ userId }}&limit=1"
          headers:
            apikey: "{{ anonKey }}"
            Authorization: "Bearer {{ authToken }}"
          afterResponse: "logSlowResponse"
          expect:
            - statusCode:
                - 200
                - 401   # token empty if 429 above — expected cascaded failure

      - think: 1

      # Order history
      - get:
          url: "/rest/v1/orders?select=id,status,total_amount,ordered_at&user_id=eq.{{ userId }}&order=ordered_at.desc&limit=20"
          headers:
            apikey: "{{ anonKey }}"
            Authorization: "Bearer {{ authToken }}"
          afterResponse: "logSlowResponse"
          expect:
            - statusCode:
                - 200
                - 401

      # Notifications
      - get:
          url: "/rest/v1/notifications?select=id,title,is_read,created_at&user_id=eq.{{ userId }}&order=created_at.desc&limit=30"
          headers:
            apikey: "{{ anonKey }}"
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode:
                - 200
                - 401

  # ── Order Placement Simulation (10%) ────────────────────────────────────────
  - name: "Order Placement"
    weight: 10
    flow:
      - function: "generateUserContext"

      # Login
      - post:
          url: "/auth/v1/token?grant_type=password"
          headers:
            apikey: "{{ anonKey }}"
            Content-Type: "application/json"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          afterResponse: "extractAuthToken"
          expect:
            - statusCode:
                - 200
                - 429

      - think: 1

      # Browse restaurants (loads menu item IDs into cache for order payload)
      - get:
          url: "/rest/v1/restaurants?select=id,name,rating,cuisine_type&is_open=eq.true&is_verified=eq.true&order=rating.desc&limit=10"
          headers:
            apikey: "{{ anonKey }}"
          afterResponse: "cacheRestaurantIds"
          expect:
            - statusCode: 200

      - get:
          url: "/rest/v1/menus?select=id,name,price,category&restaurant_id=eq.{{ restaurantId }}&is_available=eq.true&limit=20"
          headers:
            apikey: "{{ anonKey }}"
          afterResponse: "cacheMenuItemIds"
          expect:
            - statusCode: 200

      - think: 2

      # Validate cart total via edge function (read-only, no order created yet)
      - get:
          url: "/rest/v1/restaurants?select=id,delivery_fee,service_fee&id=eq.{{ restaurantId }}&limit=1"
          headers:
            apikey: "{{ anonKey }}"
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode:
                - 200
                - 401

      # Place order — accepts validation errors as expected with partial test data
      - function: "buildOrderPayload"
      - post:
          url: "/functions/v1/place-order"
          headers:
            apikey: "{{ anonKey }}"
            Authorization: "Bearer {{ authToken }}"
            Content-Type: "application/json"
          body: "{{ orderPayload }}"
          afterResponse: "logSlowResponse"
          expect:
            - statusCode:
                - 200
                - 201
                - 400   # validation error (missing fields in test payload) — expected
                - 401   # no token (429 cascaded) — expected
                - 422   # business rule violation — expected in test data